/*
  Fichier Porte.cpp
  Définition des méthodes de Porte
  Auteur : LE CORVEC Quentin Cédric Bois
*/

/****************************************************************************************************/

#include "Porte.hpp"

/****************************************************************************************************/


/****************************************************************************************************/
/**********          Constructeur                                                          **********/
/****************************************************************************************************/

////////////////////////////////////////////////////////////////////////////////////////////////////
//Méthode : Porte(std::string nom):Carte(nom)
//Paramètre : Aucun
//Précondition : Aucune
//Postcondition : Aucune
//Description : Constructeur par défaut
////////////////////////////////////////////////////////////////////////////////////////////////////
Porte::Porte(std::string nom, Effet * e):Carte(nom, e) {
}

////////////////////////////////////////////////////////////////////////////////////////////////////
//Méthode : Porte(std::string nom, std::string description):Carte(nom, description)
//Paramètre : Aucun
//Précondition : Aucune
//Postcondition : Aucune
//Description : Constructeur par défaut
////////////////////////////////////////////////////////////////////////////////////////////////////
Porte::Porte(std::string nom, std::string description, Effet * e):Carte(nom, description, e) {
}

/****************************************************************************************************/
/**********          Destructeur                                                           **********/
/****************************************************************************************************/

////////////////////////////////////////////////////////////////////////////////////////////////////
//Méthode : ~Porte() 
//Paramètre : Aucun
//Précondition : Aucune
//Postcondition : Aucune
//Description : Destructeur
////////////////////////////////////////////////////////////////////////////////////////////////////
Porte::~Porte() {
}

string Porte::type(){
	return "Porte";
}
